ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
    for(int i = 0; i < index; i++)
    {
        if(fileN->file_next != NULL)
        {
            fileN = fileN->file_next; 
        }
        else
        {
            return NULL; 
        }
    }
    return fileN; 
}


file_struct* file_new(char* data, chip_struct* chip_curr)
{
    file_struct* fileY = file_create();

    fileY->chip_parent = chip_curr;
    fileY->file_name = string_fetch(data);
    fileY->file_next = NULL;
    fileY->time_stamp = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);
    fileY->data_length = *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23);
    fileY->file_data = *(data+24) << 24 | *(data+25) << 16 | *(data+26) << 8 | *(data+27);

    if(chip_curr->file_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (chip_curr->file_curr - 1);  
        file_struct* fileZ = file_list_index(olderSiblingIndex, chip_curr); 
        fileZ->file_next = fileY;  
    }

    fileY->file_index = chip_curr->file_curr; 
    chip_curr->file_curr++; 

    return fileY;
}


file_struct* file_create(void)
{
    file_struct* fileX = malloc(sizeof(file_struct)); 
    
    fileX->file_name = "Empty";
    fileX->file_index = NULL;
    fileX->file_next = NULL;
    fileX->file_data = NULL;
    fileX->chip_parent = NULL;
    fileX->time_stamp = NULL;
    fileX->data_length = NULL;
 
    return fileX;
}


//**************************************************************  CHIP FUNCTIONS  **************************************************************//

project_struct* chips_sync(int8_t selectedItem)
{
    //index project              
    project_struct* project_selected = project_list_index(selectedItem); 

    if(project_selected->chip_first == NULL) // don't recreate structs if already created
    {
        uint16_t total_chips = project_selected->chip_num;
        uint32_t total_chip_list_size = total_chips * WORD_SIZE;

        if(total_chips != 0)
        { 
            // get chip list 
            uint32_t chip_list_address = project_selected->chip_list_addr;  
            char* chip_list_buffer = malloc(sizeof(char[total_chip_list_size]));
            flash_read(chip_list_buffer, chip_list_address, total_chip_list_size);
        
            //create first chip
            uint32_t chip_addr0 = *chip_list_buffer << 24 | *(chip_list_buffer + 1) << 16 | *(chip_list_buffer + 2) << 8 | *(chip_list_buffer + 3);
            char* chip_buffer = malloc(sizeof(char[CHIP_HEADER_SIZE])); 
            flash_read(chip_buffer, chip_addr0, CHIP_HEADER_SIZE);
            project_selected->chip_first = chip_new(chip_buffer, project_selected); // create first project(head of list) 

            // create remainder of projects, first project already made 
            for(int i = 1; i < total_chips; i++) 
            {   
                // convert 4 bytes into 32bit number 
                uint32_t chip_addr = *(chip_list_buffer + (i*4)) << 24 | *(chip_list_buffer + 1 + (i*4)) << 16 | *(chip_list_buffer + 2 + (i*4)) << 8 | *(chip_list_buffer + 3 + (i*4));
                flash_read(chip_buffer, chip_addr, CHIP_HEADER_SIZE);// read project data 
                chip_new(chip_buffer, project_selected);
            }

            free(chip_list_buffer);
            free(chip_buffer);
        }
        else
        {
            project_selected->chip_first = chip_create(); 
            project_selected->chip_first->file_first = file_create();
        }

    }
    return project_selected; 
}


chip_struct* chip_list_index(int index, project_struct* project_curr) 
{ 
    chip_struct* chipN;
    chipN = project_curr->chip_first; 

    for(int i = 0; i < index; i++)
    {
        if(chipN->chip_next != NULL)
        {
            chipN = chipN->chip_next; 
        }
        else
        {
            return NULL;
        }
    }
    return chipN; 
}


chip_struct* chip_new(char* data, project_struct* project_curr)
{  
    chip_struct* chipY = chip_create(); 
    chipY->chip_name = string_fetch(data);
    chipY->chip_type_id = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);
    chipY->file_num = *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23); 
    chipY->project_parent = project_curr; 

    chipY->file_first = NULL;
    chipY->chip_next = NULL;
    
    chipY->file_list_addr = DIRECTORY_OFFSET + PROJECT_SECTOR_OFFSET + CHIP_HEADER_SIZE + (project_curr->chip_curr * MAX_CHIP_SIZE);

    if(project_curr->chip_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (project_curr->chip_curr - 1);  
        chip_struct* chipZ = chip_list_index(olderSiblingIndex, project_curr);    //index olderSibling and assign project to project_next node of last created project, older sibling is at index of SYS_ project_num
        chipZ->chip_next = chipY;  
    }

    chipY->chip_index = project_curr->chip_curr; 
    project_curr->chip_curr++;  

    return chipY; 
}


chip_struct* chip_create(void) 
{
    chip_struct* chipX = malloc(sizeof(chip_struct));
    
    chipX->chip_name = "Empty"; //chip_name_fetch(); 
    chipX->chip_index = NULL;
    chipX->chip_next = NULL; 
    chipX->file_num = 0;
    chipX->file_curr = 0; 
    chipX->file_list_addr = NULL;
    chipX->file_first = NULL; //file_init();
    chipX->project_parent = NULL;
    chipX->chip_type_id = NULL;

    chipIterator++;
    return chipX;
}

//**************************************************************  PROJECT FUNCTIONS  **************************************************************//

void projects_sync(void) //sync projects from flash
{
    //determine number of projects from directory value
    uint8_t* num_projects = malloc(sizeof(int)); 
    flash_read(num_projects, ADDR_NUM_PROJECTS, WORD_SIZE); // read num projects // flash_read(uint8_t* buffer_rx, uint32_t start_addr, size_t DATA_SIZE_BYTES)
    uint32_t project_count = bytes_to_word(num_projects, project_count); // function to convert byte array to 32bit word 
    SYS_ projects_total = project_count; // populate system struct with project num value from flash
    free(num_projects);

