ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
    if(project_count != 0)
    {   
        // buffer all project pointers 
        uint32_t total_projects_length = project_count * WORD_SIZE; 
        uint8_t project_addr[total_projects_length]; // array sized for all project addresses 
        flash_read(project_addr, ADDR_PROJECT_PTR_FIRST, total_projects_length); // buffer for all project addresses
        
        // create first project in RAM, extract to function
        char* project_buffer = malloc(sizeof(char[PROJECT_HEADER_SIZE])); // name string plus num_chips malloc 
        uint32_t current_addr = project_addr[0] << 24 | project_addr[1] << 16 | project_addr[2] << 8 | project_addr[3]; // shift bytes into 32bit int
        flash_read(project_buffer, current_addr, PROJECT_HEADER_SIZE);
        SYS_ project_first = project_new(project_buffer); // create first project(head of list) 

        // create remainder of projects, first project already made 
        for(int i = 1; i < project_count; i++) 
        {   
            // convert 4 bytes into 32bit number 
            current_addr = project_addr[0 + (i*4)]  << 24 | project_addr[1 + (i*4)] << 16 | project_addr[2 + (i*4)] << 8 | project_addr[3 + (i*4)];
            flash_read(project_buffer, current_addr, PROJECT_HEADER_SIZE);// read project data 
            project_new(project_buffer);
        }
        free(project_buffer);
    }
    else
    {
        SYS_ project_first = project_create(); // create empty project - chip - file structures
        SYS_ project_first->chip_first = chip_create();
        SYS_ project_first->chip_first->file_first = file_create();
    }
}


project_struct* project_list_index(int index) 
{ 
    project_struct* projectN;
    projectN = SYS_ project_first; 

    for(int i = 0; i < index; i++) 
    {
        if(projectN->project_next != NULL)
        {
            projectN = projectN->project_next; 
        }
        else
        {
            return NULL; 
        }
    }
    return projectN; 
}


project_struct* project_new(char* data) //input 24 byte project data, string, num_chips, and chip_first address
{
    project_struct* projectY = project_create(); //create project
    projectY->project_name = string_fetch(data);  // send in payload, fetch from flash
    projectY->chip_num = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);
    projectY->project_next = NULL;
    projectY->chip_first = NULL; 
    projectY->chip_list_addr = DIRECTORY_OFFSET + PROJECT_HEADER_SIZE + (SYS_ project_curr * MAX_PROJECT_SIZE); //was *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23);// NOTE MAKE ACTUAL FLASH ADDRESS OF FIRST CHIP BASED ON MAX PROJECT LENGTH 
    projectY->chip_curr = 0;

    if(SYS_ project_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (SYS_ project_curr - 1);  
        project_struct* projectZ = project_list_index(olderSiblingIndex);    //index olderSibling and assign project to project_next node of last created project, older sibling is at index of SYS_ project_num
        projectZ->project_next = projectY;  
    }
  
    projectY->project_index = SYS_ project_curr; 
    SYS_ project_curr++; 

    return projectY; //should return newly created to global
}


project_struct* project_create(void) 
{
    project_struct* projectX = malloc(sizeof(project_struct));
    
    projectX->project_name = "Empty"; //project_name_fetch();
    projectX->project_index = NULL;
    projectX->project_next = NULL;
    projectX->chip_num = 0;
    projectX->chip_curr = 0;
    projectX->chip_first = NULL; // chip_create();
    projectX->chip_list_addr = NULL;
    
    projectIterator++;
    return projectX; 
}

//**************************************************************************************************************************************************//




void system_init(void) // create global system struct and read directory info from flash, create project structs 
{   
    system_singleton = system_new();  
    //flash_init(); //erase and rewrite test flash
    projects_sync(); 
}


char* firmware_version_fetch(void)
{
    //fetch FW version from flash 
    return systemFirmware;
}


char* string_fetch(char* data)
{
    char* name_string = malloc(sizeof(char[MAX_STRING_SIZE])); //TODO FREE 
    memcpy(name_string, data, MAX_STRING_SIZE); //16 bytes = max string length 
    return name_string;
}


//**************************************************************  DISPLAY FUNCTIONS  **************************************************************//

void clear_list(void)
{
      //SSD1351_draw_filled_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
      SSD1351_draw_filled_rect(10, 53, 110, 20, COLOR_BLACK);
      SSD1351_draw_filled_rect(10, 80, 110, 20, COLOR_BLACK);
      SSD1351_draw_filled_rect(10, 105, 110, 20, COLOR_BLACK);
       
      SSD1351_draw_filled_rect(0, 30, 110, 15, COLOR_BLACK); // clear header
      L_ headerPresent = false;
}


void rerender_list(int8_t itemHighlighted) // use screenStack 
{   
    if(strlen(L_ items[itemHighlighted]) > 3)
    {
        clear_list();
        draw_header();
   
        if(strlen(L_ items[itemHighlighted]) > 3) // name must be longer than 3 char, less than MAX_STRING_SIZE
        {
            SSD1351_set_cursor(10,57);
            SSD1351_printf(COLOR_WHITE, curr_font, L_ items[itemHighlighted]);
        }
        if(strlen(L_ items[itemHighlighted+1]) > 3)
        {
            SSD1351_set_cursor(10,83);
            SSD1351_printf(COLOR_WHITE, curr_font, L_ items[itemHighlighted+1]);
        }
        if(strlen(L_ items[itemHighlighted+2]) > 3)
        {
            SSD1351_set_cursor(10,105);
            SSD1351_printf(COLOR_WHITE, curr_font, L_ items[itemHighlighted+2]);
        }
        SSD1351_update();
    }
    else
    {
        reduce_itemHighlighted();
    }
}


void project_name_fetch(void)
{
    for(int x = 0; x < MAX_PROJECTS; x++) //MAX_PROJECTS = 27 
    {
        L_ items[x] = project_list_index(x)->project_name;
    }
}


void chip_name_fetch(int8_t selectedItem)
{
    for(int x = 0; x < MAX_CHIPS; x++) //MAX_CHIPS = 27 
    {
        L_ items[x] = chip_list_index(x, project_list_index(selectedItem))->chip_name;
    }
}


